my_list = ["Яблоки","Бананы","Груши","Виноград","Ананасы","Инжир"]
print("Список: ", my_list)
print("Первое значение: ", my_list[0])
print("Последнее значение: ", my_list[-1])
print("Значение с третьего по пятого элемента: ", my_list[2:5])
my_list[2] = "Лимоны"
print("Корректировка списка: ", my_list[2])
print("Измененный список: ", my_list)

my_dict = {"Яблоко": 52,"Банан": 89,"Гуава": 68,"Виноград": 67,"Ананас": 50,"Инжир": 74}
print("Словарь: ", my_dict)
print('Значение для ключа Банан: ', my_dict["Банан"])
my_dict.update({"Киви": 61})
print("Изменный словарь: ", my_dict)





