from config import * #чтобы получить доступ к нашим ценам, импортируем всё из файла

start = "Рады вас приветствовать в магазине настольных игр."
about = "Мы продаем лучшие настольные игры уже 2000 лет, но вы нам не поверите, поэтому скажем, что нам уже год."
gameM = f"Лучший вариант для начинающих, игра небольшого размера. Стоимость {priceM} рублей."
gameL = f"Альтернатива для тех, кто не знает, что выбрать. Стоимость {priceL} рублей."
gameXL = f"Лучший комплект. Полный кайф. Стоимость {priceXL} рублей."
other =  f"Хотите что-то другое? Обратитесь к админу - @MegaAdminNastolok.ru"